[
    {
    "title": "Slim6 Alpha 0.3",
    "date": "Wednesday, 29 june 2016",
    "content": [
      "This weekly includes more bug fixes, features, and support for new devices. ",
      "#### New features:",
      "* Layers support",
      "* Add dt2w on doze",
      "* Show each app name being optimized during boot",
      "",
      "#### New devices",
      "* OnePlus One (Bacon)",
      "* LG G2 (d801)",
      "",
      "#### Changes",
      "* Updates to bionic",
      "* Updates to sepolicy",
      "* Updates to device/qcom/common",
      "* Stagefright-plugins: call packet_queue_init earier",
      "* Hide optimizing app dialog on first boot",
      "* Updates to frameworks/native and frameworks/opt/net/wifi",
      "* Updates to system/bt, core, and vold",
      "* Fix browser permissions",
      "* Fix proximity check on non power key",
      "* DeskClock: update translation plural formattings",
      "* Updates to hardware/qcom/audio-caf/msm8960",
      "",
      "#### Device Specifics:",
      "* Hima: remove hard-coded photo preview size",
      "* Hima: fix headphone sound",
      "* Onyx update to sepolicy",
      "* Onyx updates to mpdecision",
      "*Onyx add support for China ctcc variant"
      
      ]
    },
    {
    "title": "Slim6 Alpha 0.2",
    "date": "Wednesday, 22 june 2016",
    "content": [
      "This weekly includes bug fixes, new features, and support for more devices.",
      "We have also setup a [bug tracker](https://bugs.slimroms.org) to keep track of them bugs!",
      "For now, you won’t be able to act on issues, you will only be able to track the issues including their status, priority, progress.. etc.",
      "",
      "We are looking for java developers capable of creating new projects as well as working on existing ones.",
      "If you are interested, contact us at slimroms@gmail.com.",
      "Make sure to include links to your work, and sources if your work is open source.",
      "#### New features:",
      "* Slim Doze/Ambient display options",
      "* Proximity Wake",
      "* Proximity Speaker",
      "* Toggle for waking up device when charger is plugged in",
      "",
      "#### New devices",
      "* OnePlus Two",
      "* OnePlus x (onyx)",
      "* Nexus 5x (bullhead)",
      "",
      "#### Changes",
      "* Merge android-6.0.1_r46",
      "* Updates to av, ffmpeg, stagefright-plugins",
      "* Updates to art",
      "* Updates to skia",
      "* Updates to sepolicy",
      "* Updates wpa_supplicant_8",
      "* Fix DeskClock settings crash",
      "* Fix AppOpps crash on none US english",
      "* Fix Gallery editor crash",
      "",
      "#### Device Specifics:",
      "* Upstream update to kernel_htc_msm8994",
      "* Upstream updates to hima",
      "* Upstream updates to m8",
      "* Upstream updates to surnia device and kernel",
      "* Rebase kernel for mondrianwifi"
      ]
    },
    {
    "title": "The road to marshmallow",
    "date": "Wednesday, 15 june 2016",
    "content": [
      "Slim6, based on marshmallow 6.0.1, is now available for download!",
      "Slim6 is still in its early stages of development so if your favourite feature is not back yet, don’t worry more will be added with later releases along with additional devices.",
      "",
      "We are currently looking for device maintainers.",
      "We expect you to know your way around android and be able to fix problems as they emerge not just a builder.",
      "With that being said, you can contact us at slimroms@gmail.com.",
      "In your email please link your work, sources, and specify why you think you’d be a good addition to our team.",
      "Work related to slimroms is preferable but not mandatory.",
      "#### Features",
      "* DPI Changer",
      "* SlimLauncher",
      "* Root access",
      "",
      "#### Supported devices",
      "* Nexus 6p (angler)",
      "* Nexus 6 (shamu)",
      "* Nexus 9 (flounder)",
      "* Nexus 5 (hammerhead)",
      "* Nexus 7 2nd gen (flo)",
      "* Nexus 4 (mako)",
      "* HTC one M9 GSM (himaul)",
      "* HTC One M8",
      "* Moto E LTE second gen (surnia)",
      "* Samsung Galaxy Tab Pro 8.4 (mondrianwifi)"
      ]
    },
    {
    "title": "Slim Zombie?",
    "date": "Tuesday, 8 September 2015",
    "content": [
      "It’s been a while… A long while... We feel it’s time to shed light on what happened, what is happening, and what will be happening with Slim.",
      "",
      "First things first. We are not dead. Well, technically we were... but we’re back. So I guess we’re #SlimZombie now ;)",
      "",
      "**Where did we go?**",
      "",
      "Technically, we didn't go anywhere. We've been working hard behind the scenes, we just haven't been posting much, be it updates on what was going on, or builds (which was delegated to our device maintainers as a temporary measure).",
      "",
      "Our issues began when one of our team left quite suddenly. Back in the day, we were really small, so everything was paid through one individual.",
      "",
      "As we expanded, we didn't think anything of it. When this person left, we realised how much responsibility and power this meant, since we had just lost control of all our servers, as well as all the funding for them.",
      "",
      "So we decided to become a legal entity, so that we weren't reliant on an individual, and so that an individual was not being affected by paying however much we pay per month out of their personal bank account.",
      "",
      "We want to make this clear, we have no intention of making money out of this. Anything that we do, we do it to make the community a better place. Since we had a few members from Germany in the core team back then, we decided to become an e.V, or eingetragener Verein (registered association). This was going well, until our beloved lead, Kufikugel, had to step away suddenly due to personal reasons.",
      "",
      "We won’t go into details here, since it touches on personal matters of several of our team members. Our servers ended up getting shut down for a week due to the e.V process taking longer than expected. This is one of the reasons why we said not to use the old site anymore. The end result was, we were locked out of all the current systems.",
      "",
      "As it is with life, by making mistakes you have the potential to learn. We made plenty of mistakes, and we have learned a lot. Thank you to those who have helped us through this rough time.",
      "",
      "**So what’s happening now?**",
      "",
      "SlimRoms is now a registered LTD in the UK. You can find the legal documents [here](https://beta.companieshouse.gov.uk/company/09757411). This does not mean we are abandoning the community, nor do we care about making money. Any surplus money will go towards making the experience for the community better, be it funding device maintainers, better servers, or even giveaways. Who knows, the potential for helping the community is limitless.",
      "We have five directors, and six shareholders, all are at the heart of the team. These people will make the final decisions for Slim. However, we will always listen to and respect the voice of the community, as well as the rest of the team.",
      "",
      "Our old Gerrit will be taken down, and our new Gerrit will be moved over to that server, as it is better suited to managing the monstrosity that Google has made. Everything important has already been migrated to the new Gerrit. The old site will remain open until the new site is finished. Since we don’t have any dedicated front end web developers on the team, help here will be much appreciated.",
      "",
      "The forum will be taken down as soon as possible, and there are no plans to bring it back. We recommend people to stick with XDA. We have our own area [there](http://forum.xda-developers.com/slimroms).",
      "",
      "As for the files, one of our infrastructure devs have been through all of them. We deem them safe to download again however Because of their age, they are susceptible to some known exploits in Android, so we recommend you get the latest version from your device maintainer until the new official builds go up. As a result, the old downloads will not be added to the new download system.",
      "",
      "**When will builds be going up?**",
      "",
      "Sorry, but it’s gonna be a #soon.",
      "We are aiming for as soon as possible. Our developers are working hard to get everything perfect, as we will only have time to do one stable build before M hits. Even if we miss it, there will be a stable build for SlimLP, so don’t worry. New features are also in the works, though we have no prediction for when they might be done.",
      "",
      "**What are your aims?**",
      "",
      "We give great pleasure in saying that Slim will be one of the teams taking part in the project that Bitsyko recently spoke about. The aim is to pool our resources together, and bring up a common base for hardware that other roms can use to get a stable base.",
      "",
      "We also have some, to say the least, interesting projects on the way to make life easier for our team. The plan is to open bits of our infrastructure up to the general community as well. What’s the use in writing your own technology if you’re just going to keep it to yourself? ;) Till then #KeepItSlim"
    ]
  },
  {
    "title": "SlimROMs and SlimLP updates",
    "date": "Wednesday, 8 April 2015",
    "content": [
      "**Where is my fully featured SlimLP?**",
      "",
      "We're working on Slim 5.1. You can follow the progress on Gerrit but it's taking a little bit longer",
      "than usual as our hands are full with our brand new open source website, internal changes, hosting..etc.",
      "",
      "You can check the website source [here](https://github.com/SlimRoms/slimroms.github.io)",
      "",
      "Did I mention that we've also got a new [Gerrit](https://review.slimroms.org)? Oh and it's blue!",
      "",
      "**We demand a status update on the old website and infrastructure issues!**",
      "",
      "Till we state otherwise or get into more details. Our last statement stands as it is. Don't download",
      "anything from the old website. If you want Slim gapps or build for you device then go to our gapps or",
      "your device thread on xda respectively.",
      "",
      "Change requires time but we can assure you that SlimROMs is not dead and we will come back better than",
      "ever! till then **keep it slim.**",
      "",
      "***",
      "",
      "keep in mind the website is still a WIP however you can always contribute by pushing commits to our Gerrit."
    ]
  },
  {
    "title": "TRPS!",
    "date": "Wednesday, 1st April 2015",
    "content": [
      "We're back, and we're pink! After much research, we have realised that Material on Android isn't",
      "working so well.",
      "",
      "Over the past month, we have sent out different designs to some of our testers. The feedback that",
      "we got was the design is fine, it's just the colour scheme.",
      "",
      "We would like to officially announce TRPS! It's still in the works, but it will be coming to your",
      "devices soon.",
      "",
      "In support of this announcement, we have turned our [Gerrit](https://review.slimroms.org) pink.",
      "",
      "support us by turning something pink! Post pictures with #SlimPink. The best will be showcased on",
      "the new site."
    ]
  },
  {
    "title": "SlimLP Alpha 1.0 (Android 5.0)",
    "date": "Monday, 17 February 2015",
    "content": [
      "We are proud to announce the first weekly for SlimLP. Please note not all devices are getting a",
      "weekly yet. This is the first alpha release more devices and features to come as we move forward.",
      "#### Features:",
      "",
      "* RRO Layers Support",
      "* Doze (ambient display) time-out (selected devices only)",
      "* Options for battery icon and text",
      "* Privacy guard",
      "* Slim Heads up",
      "* Slim Dialer",
      "",
      "***",
      "",
      "Keep in mind Jenkins build order is random so we can't say when a specific build will be ready."
    ]
  },
  {
    "title": "Slim updates",
    "date": "Tuesday, 16 December 2014",
    "content": [
      "As we mentioned couple weeks ago, we're working on SlimLP and already added some of our features",
      "e.g. Slim heads up, privacy guard, slim dialer, lockscreen shortcuts and much more.",
      "",
      "With the steady progress of SlimLP and current stability of Slimkat we decided to go for Slimkat",
      "9.0 next week. With that being said we'll take the week off for testing purposes so no release this",
      "week, hope you have a great week and remember to **keep it slim.**"
    ]
  },
  {
    "title": "SlimROMs meets lollipop",
    "date": "Saturday, 06 December 2014",
    "content": [
      "As some of you already know we extended Slimkat weeklies to make them as stable as possible but that",
      "doesn't mean we're neglecting lollipop. We are already working on lollipop and pushed multiple alpha",
      "builds for both nexus 5 and 4 with some of our added features like privacy guard, sounds tweaks, status",
      "bar tweaks and much more. It's been decided that the new version of Slim + lollipop will be called SlimLP.",
      "We would like to thank +Cristian Giordano for the great work on the new boot animation. Stay tuned for more",
      "SlimLP news :)"
    ]
  },
  {
    "title": "SlimROMs moves to Crowdin",
    "date": "Friday, 21 November 2014",
    "content": [
      "We have officially moved all translations back to crowdin. **What does that mean?**",
      "1. Easier way for users to translate SlimRoms to their language with a slight to no learning curve.",
      "2. We won't accept new translations on Gerrit. All the translations must be made through crowdin.",
      "",
      "#### Before users had to:",
      "",
      "* Have Git.",
      "* Clone the repo in question.",
      "* Do the changes, commit and push them to our Gerrit.",
      "* Add someone from the team to review and merge the translations.",
      "",
      "***",
      "",
      "[Our Crowdin Project](https://crowdin.com/project/slimroms)",
      "[Crowdin quick guide](https://crowdin.com/page/quick-start)"
    ]
  }
]